; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_3 object type_2 type_1)
 (:predicates (pred_3 ?v5 - type_2 ?v1 - type_3)
 	      (pred_2 ?v3 - object ?v1 - type_3)
	      (pred_4 ?v5 - type_2 ?v7 - type_1)
	      (pred_1 ?v5 - type_2 ?v3 - object ?v7 - type_1))

   (:action op_2
       :parameters  (?v5 - type_2 ?v6 ?v4 - type_3)
       :precondition (and  (pred_3 ?v5 ?v6))
       :effect (and  (pred_3 ?v5 ?v4)
		     (not (pred_3 ?v5 ?v6))))

   (:action op_3
       :parameters (?v5 - type_2 ?v2 - object ?v8 - type_3 ?v7 - type_1)
       :precondition  (and  (pred_2 ?v2 ?v8) (pred_3 ?v5 ?v8) (pred_4 ?v5 ?v7))
       :effect (and (pred_1 ?v5 ?v2 ?v7)
		    (not (pred_2 ?v2 ?v8)) 
		    (not (pred_4 ?v5 ?v7))))

   (:action op_1
       :parameters (?v5 - type_2 ?v2 - object ?v8 - type_3 ?v7 - type_1)
       :precondition  (and  (pred_1 ?v5 ?v2 ?v7) (pred_3 ?v5 ?v8))
       :effect (and (pred_2 ?v2 ?v8)
		    (pred_4 ?v5 ?v7)
		    (not (pred_1 ?v5 ?v2 ?v7)))))

; problem
(define (problem gripper-2-4-3)
(:domain gripper-strips)
(:objects obj_13 obj_12 - type_2
obj_03 obj_02 obj_09 obj_01 - type_1
obj_11 obj_06 obj_10 obj_08 - type_3
obj_04 obj_05 obj_07 - object)
(:init
(pred_3 obj_13 obj_08)
(pred_4 obj_13 obj_03)
(pred_4 obj_13 obj_02)
(pred_3 obj_12 obj_10)
(pred_4 obj_12 obj_09)
(pred_4 obj_12 obj_01)
(pred_2 obj_04 obj_11)
(pred_2 obj_05 obj_11)
(pred_2 obj_07 obj_11)
)
(:goal
(and
(pred_2 obj_04 obj_10)
(pred_2 obj_05 obj_11)
(pred_2 obj_07 obj_06)
)
)

(:constraints
  (always (not (pred_3 obj_13 obj_10)))
)
)

; plan
1. (op_2 obj_13 obj_08 obj_06)
   deleted: (pred_3 obj_13 obj_08)
   added: (pred_3 obj_13 obj_06)
   goals met: 1 of 3
2. (op_2 obj_12 obj_10 obj_11)
   deleted: (pred_3 obj_12 obj_10)
   added: (pred_3 obj_12 obj_11)
   goals met: 1 of 3
3. (op_3 obj_12 obj_07 obj_11 obj_01)
   deleted: (pred_2 obj_07 obj_11) (pred_4 obj_12 obj_01)
   added: (pred_1 obj_12 obj_07 obj_01)
   goals met: 1 of 3
4. (op_3 obj_12 obj_04 obj_11 obj_09)
   deleted: (pred_2 obj_04 obj_11) (pred_4 obj_12 obj_09)
   added: (pred_1 obj_12 obj_04 obj_09)
   goals met: 1 of 3
5. (op_2 obj_12 obj_11 obj_06)
   deleted: (pred_3 obj_12 obj_11)
   added: (pred_3 obj_12 obj_06)
   goals met: 1 of 3
6. (op_1 obj_12 obj_07 obj_06 obj_01)
   deleted: (pred_1 obj_12 obj_07 obj_01)
   added: (pred_2 obj_07 obj_06) (pred_4 obj_12 obj_01)
   goals met: 2 of 3
7. (op_2 obj_12 obj_06 obj_10)
   deleted: (pred_3 obj_12 obj_06)
   added: (pred_3 obj_12 obj_10)
   goals met: 2 of 3
8. (op_1 obj_12 obj_04 obj_10 obj_09)
   deleted: (pred_1 obj_12 obj_04 obj_09)
   added: (pred_2 obj_04 obj_10) (pred_4 obj_12 obj_09)
   goals met: 3 of 3
